# Pyspark Básico
## Instalamos Pyspark

In [165]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\users\jonatan\appdata\local\programs\python\python312\lib\site-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\jonatan\appdata\local\programs\python\python312\lib\site-packages (from pyspark) (0.10.9.7)

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

## Importamos pyspark

In [166]:
import pyspark

In [167]:
from pyspark.sql import SparkSession

In [168]:
import pandas as pd
df = pd.read_csv("./data/test1.csv")

Vamos a crear una sesión 
Esto nos da acceso  a la API DataFrame y DataSet, que son los elementos sobre los que trabajaremos de una forma "parecida" a como hemos trabajado los Dataframes de Pandas

In [169]:
#Java error: https://www.java.com/download/ie_manual.jsp
# reiniciar
spark = SparkSession.builder.appName("Practise").getOrCreate()

In [170]:
spark

Ahora vamos a leer el fichero a través de la interfaz de sparkm

In [171]:
df_pyspark = spark.read.csv("./data/test1.csv")

In [172]:
df_pyspark.show()

+---------+---+----------+------+
|      _c0|_c1|       _c2|   _c3|
+---------+---+----------+------+
|     Name|age|Experience|Salary|
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [173]:
# Por defecto no lee los nombres de las columnas!
df_pyspark = spark.read.csv("./data/test1.csv", header=True)
df_pyspark.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [174]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- Experience: string (nullable = true)
 |-- Salary: string (nullable = true)

Pyspark DataFrames  

* Leer un dataset  
* Comprobar el Schema  
* Seleccionar columnas e indexarlas  
* Opcion de describe similar a Pandas  
* Manipular columnas: Añadir, Eliminar, Renombrar Columnas

In [175]:
df_pyspark_3 = spark.read.csv("./data/test1.csv", header = True, inferSchema= True)

In [176]:
df_pyspark_3.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [177]:
df_pyspark_3.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [178]:
# Comparar pandas
df.dtypes

Name          object
age            int64
Experience     int64
Salary         int64
dtype: object

In [179]:
df_pyspark_4 = spark.read.option("header","true").option("inferSchema","true").csv("./data/test1.csv")

In [180]:
df_pyspark_4.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [181]:
df_pyspark_3.dtypes

[('Name', 'string'), ('age', 'int'), ('Experience', 'int'), ('Salary', 'int')]

In [182]:
df_pyspark_3.describe().show()

+-------+------+------------------+-----------------+------------------+
|summary|  Name|               age|       Experience|            Salary|
+-------+------+------------------+-----------------+------------------+
|  count|     6|                 6|                6|                 6|
|   mean|  NULL|26.333333333333332|4.666666666666667|21333.333333333332|
| stddev|  NULL| 4.179314138308661|3.559026084010437| 5354.126134736337|
|    min|Harsha|                21|                1|             15000|
|    max| Sunny|                31|               10|             30000|
+-------+------+------------------+-----------------+------------------+

In [183]:
df_pyspark_3.head()

Row(Name='Krish', age=31, Experience=10, Salary=30000)

In [184]:
df_pyspark_3.head(4)

[Row(Name='Krish', age=31, Experience=10, Salary=30000),
 Row(Name='Sudhanshu', age=30, Experience=8, Salary=25000),
 Row(Name='Sunny', age=29, Experience=4, Salary=20000),
 Row(Name='Paul', age=24, Experience=3, Salary=20000)]

SELECCIONAR COLUMNAS (select)

SELECCIONAR COLUMNAS POR NOMBRE

In [185]:
df["Name"]

0        Krish
1    Sudhanshu
2        Sunny
3         Paul
4       Harsha
5      Shubham
Name: Name, dtype: object

In [186]:
df_pyspark_3.select("Name")

DataFrame[Name: string]

En realidad todavía no ha hecho la operación, está esperando a que "sea necesario"

In [187]:
df_pyspark_3.select("Name").show()

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
|    Sunny|
|     Paul|
|   Harsha|
|  Shubham|
+---------+

In [188]:
df[["Name","Salary"]]

        Name  Salary
0      Krish   30000
1  Sudhanshu   25000
2      Sunny   20000
3       Paul   20000
4     Harsha   15000
5    Shubham   18000

In [189]:
df_pyspark_3.select(["Name","Salary"]).show()

+---------+------+
|     Name|Salary|
+---------+------+
|    Krish| 30000|
|Sudhanshu| 25000|
|    Sunny| 20000|
|     Paul| 20000|
|   Harsha| 15000|
|  Shubham| 18000|
+---------+------+

INDEXADO POR COLUMNA

In [190]:
df.columns[:2]

Index(['Name', 'age'], dtype='object')

In [191]:
df_pyspark_3.columns[:2]

['Name', 'age']

In [192]:
df.iloc[:,:2]

        Name  age
0      Krish   31
1  Sudhanshu   30
2      Sunny   29
3       Paul   24
4     Harsha   21
5    Shubham   23

In [193]:
df_pyspark_3.select(df_pyspark_3.columns[:2]).show()

+---------+---+
|     Name|age|
+---------+---+
|    Krish| 31|
|Sudhanshu| 30|
|    Sunny| 29|
|     Paul| 24|
|   Harsha| 21|
|  Shubham| 23|
+---------+---+

In [194]:
df.iloc[2:4,:2]

    Name  age
2  Sunny   29
3   Paul   24

In [195]:
df_pyspark_3.select(df_pyspark_3.columns[:2]).show(3)

+---------+---+
|     Name|age|
+---------+---+
|    Krish| 31|
|Sudhanshu| 30|
|    Sunny| 29|
+---------+---+
only showing top 3 rows

CREANDO UNA NUEVA COLUMNA

In [196]:
df["new_column"] = df["Experience"] + 2
df

        Name  age  Experience  Salary  new_column
0      Krish   31          10   30000          12
1  Sudhanshu   30           8   25000          10
2      Sunny   29           4   20000           6
3       Paul   24           3   20000           5
4     Harsha   21           1   15000           3
5    Shubham   23           2   18000           4

In [197]:
df_pyspark_4 = df_pyspark_4.withColumn("new_column", df_pyspark_4["Experience"] + 2)

In [198]:
df_pyspark_4.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- new_column: integer (nullable = true)

In [199]:
df_pyspark_4.show()

+---------+---+----------+------+----------+
|     Name|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

ELIMINANDO COLUMNAS

In [200]:
df.drop("new_column", axis = 1)

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [201]:
df_pyspark_4.drop("Experience")

DataFrame[Name: string, age: int, Salary: int, new_column: int]

In [202]:
df_pyspark_4.show()

+---------+---+----------+------+----------+
|     Name|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

RENOMBRANDO COLUMNAS

In [203]:
df.rename(columns={"Name": "Nombre"}, inplace = True)

In [204]:
df

      Nombre  age  Experience  Salary  new_column
0      Krish   31          10   30000          12
1  Sudhanshu   30           8   25000          10
2      Sunny   29           4   20000           6
3       Paul   24           3   20000           5
4     Harsha   21           1   15000           3
5    Shubham   23           2   18000           4

In [205]:
df_pyspark_4.withColumnRenamed("Name","Nombre").show()

+---------+---+----------+------+----------+
|   Nombre|age|Experience|Salary|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

In [206]:
df_renombrado = df_pyspark_4.withColumnRenamed("Name","Nombre")

In [207]:
df_renombrado_2 = df_renombrado.withColumnRenamed("Salary","Nomina")

In [208]:
df_renombrado_2.show()

+---------+---+----------+------+----------+
|   Nombre|age|Experience|Nomina|new_column|
+---------+---+----------+------+----------+
|    Krish| 31|        10| 30000|        12|
|Sudhanshu| 30|         8| 25000|        10|
|    Sunny| 29|         4| 20000|         6|
|     Paul| 24|         3| 20000|         5|
|   Harsha| 21|         1| 15000|         3|
|  Shubham| 23|         2| 18000|         4|
+---------+---+----------+------+----------+

MISSING VALUES

In [209]:
df_pyspark_5 = spark.read.csv("./data/test2.csv", header = True, inferSchema= True)

In [210]:
df_pyspark_5.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

Eliminando las filas que no nos interesan

In [211]:
df_sin_missing = df_pyspark_5.na.drop()

In [212]:
df_sin_missing.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [213]:
df_sin_col_missing = df_pyspark_5.select(["age","Salary"])

In [214]:
df_sin_col_missing.show()

+----+------+
| age|Salary|
+----+------+
|  31| 30000|
|  30| 25000|
|  29| 20000|
|  24| 20000|
|  21| 15000|
|  23| 18000|
|NULL| 40000|
|  34| 38000|
|  36|  NULL|
+----+------+

La función drop tiene varios parámetros, entre ellos "how", con valores "any" y "all".  
* how = "any" elimina la fila si uno de los valores es nulo (comportamiento por defecto)
* how = "all" elimina la fila si todos los valores son nulos  
Otro parámetro es "tresh". Nos dice el número minimo de valores no nulos que teine que tener una fila antes de eliminarla. Por ejemplo tresh = 2, mantiene las columnas con al menos 2 valores NO NULOS

In [215]:
df_pyspark_5.na.drop(how = "any").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [216]:
df_pyspark_5.na.drop(how = "all").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [217]:
df_pyspark_5.na.drop(how = "any", thresh= 2).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [218]:
df_2 = pd.read_csv("./data/test2.csv")

In [219]:
df_2

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

In [220]:
df_2.dropna(how = "any")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0

In [221]:
df_2.dropna(how = "all")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

Eliminando valores por columna

In [222]:
df_pyspark_5.na.drop(subset=("Experience")).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [223]:
df_2.dropna(subset= "Experience")

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
7        NaN  34.0        10.0  38000.0

IMPUTACION DE MISSING VALUES

In [224]:
df_pyspark_5.na.fill(20).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh| 20|        20| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|        20|    20|
+---------+---+----------+------+

In [225]:
df_pyspark_5.na.fill("Pepe").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     Pepe|  34|        10| 38000|
|     Pepe|  36|      NULL|  NULL|
+---------+----+----------+------+

In [226]:
df_2.fillna(20)

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh  20.0        20.0  40000.0
7         20  34.0        10.0  38000.0
8         20  36.0        20.0     20.0

In [227]:
df_2.Experience.fillna(20)

0    10.0
1     8.0
2     4.0
3     3.0
4     1.0
5     2.0
6    20.0
7    10.0
8    20.0
Name: Experience, dtype: float64

In [228]:
df_pyspark_5.na.fill({"Name": "Ana", "Experience": 3}).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|         3| 40000|
|      Ana|  34|        10| 38000|
|      Ana|  36|         3|  NULL|
+---------+----+----------+------+

In [229]:
from pyspark.ml.feature import Imputer

In [230]:
imputer_mean = Imputer(inputCols = ["age","Experience","Salary"], outputCols= ["imputed_age", "imputed_Experience","imputed_Salary"]).setStrategy("mean")

In [231]:
imputer_mean.fit(df_pyspark_5).transform(df_pyspark_5).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|imputed_age|imputed_Experience|imputed_Salary|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+---------+----+----------+------+-----------+------------------+--------------+

FILTRADOS Y CONDICIONES

In [232]:
df_pyspark_5.filter("Salary <= 20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [233]:
condicion = df_2["Experience"] < 3
condicion_spark = df_pyspark_5["Experience"] < 3

In [234]:
df_2[condicion]

      Name   age  Experience   Salary
4   Harsha  21.0         1.0  15000.0
5  Shubham  23.0         2.0  18000.0

In [235]:
df_pyspark_5.filter(condicion_spark).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [236]:
condicion_spark_2 = (condicion_spark) & (df_pyspark_5["Salary"] > 10000)

In [237]:
df_pyspark_5.filter(condicion_spark_2).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [238]:
condicion_2 = (condicion) & (df_2["Salary"] > 10000)
df_2[condicion_2]

      Name   age  Experience   Salary
4   Harsha  21.0         1.0  15000.0
5  Shubham  23.0         2.0  18000.0

In [239]:
no_Harsha = ~(df_pyspark_5["Name"] == "Harsha")

In [240]:
df_pyspark_5.filter(no_Harsha).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
+---------+----+----------+------+

GROUPBY

In [241]:
df_pyspark_6 = spark.read.csv("./data/test3.csv", header = True, inferSchema= True)

In [242]:
df_pyspark_6.show()

+---------+------------+------+
|     Name| Departments|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [243]:
df_pyspark_6.groupby("Name").show()

AttributeError: 'GroupedData' object has no attribute 'show'

In [ ]:
df_grouped = df_pyspark_6.groupBy("Name")

In [ ]:
df_grouped.sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [ ]:
df_pyspark_6.groupby("Name").sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [ ]:
df_grouped.count().show()

+---------+-----+
|     Name|count|
+---------+-----+
|Sudhanshu|    3|
|    Sunny|    2|
|    Krish|    3|
|   Mahesh|    2|
+---------+-----+

In [ ]:
df_3 = pd.read_csv("./data/test3.csv")

In [ ]:
df_3

        Name   Departments  Salary
0      Krish  Data Science   10000
1      Krish           IOT    5000
2     Mahesh      Big Data    4000
3      Krish      Big Data    4000
4     Mahesh  Data Science    3000
5  Sudhanshu  Data Science   20000
6  Sudhanshu           IOT   10000
7  Sudhanshu      Big Data    5000
8      Sunny  Data Science   10000
9      Sunny      Big Data    2000

In [ ]:
pd_grouped = df_3.groupby("Name")

In [ ]:
pd_grouped.sum(numeric_only= True)

           Salary
Name
Krish       19000
Mahesh       7000
Sudhanshu   35000
Sunny       12000

In [ ]:
df_department = df_pyspark_6.groupBy("Departments")

In [ ]:
df_department.count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

In [ ]:
df_department.sum().show()

+------------+-----------+
| Departments|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [ ]:
df_department.mean().show()

+------------+-----------+
| Departments|avg(Salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [ ]:
pd_departments = df_3.groupby("Departments")

In [ ]:
pd_departments.count()

              Name  Salary
Departments
Big Data         4       4
Data Science     4       4
IOT              2       2

In [ ]:
pd_departments.sum()

C:\Users\glezr\AppData\Local\Temp\ipykernel_45196\1222710475.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  pd_departments.sum()

              Salary
Departments
Big Data       15000
Data Science   43000
IOT            15000

In [ ]:
pd_departments.sum(numeric_only= True)

              Salary
Departments
Big Data       15000
Data Science   43000
IOT            15000

AGGREGATE

In [ ]:
df_pyspark_6.agg({"Salary": "sum"}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+

In [ ]:
df_pyspark_6.groupBy("Departments").agg({"Salary": "sum"}).show()

+------------+-----------+
| Departments|sum(Salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [ ]:
pd_departments.agg({"Salary": "sum", "Salary": "mean", "Name": "count"})

               Salary  Name
Departments
Big Data       3750.0     4
Data Science  10750.0     4
IOT            7500.0     2

In [ ]:
df_pyspark_6.groupBy("Departments").agg({"Salary": "sum", "Salary": "mean", "Name": "count"}).show()

+------------+-----------+-----------+
| Departments|avg(Salary)|count(Name)|
+------------+-----------+-----------+
|         IOT|     7500.0|          2|
|    Big Data|     3750.0|          4|
|Data Science|    10750.0|          4|
+------------+-----------+-----------+

APLICAR FUNCIONES

In [ ]:
from pyspark.sql.functions import lower,col,ascii,mean

In [ ]:
df_pyspark_6.show()

+---------+------------+------+
|     Name| Departments|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [ ]:
df_pyspark_6.select(lower(col("Name"))).show()

+-----------+
|lower(Name)|
+-----------+
|      krish|
|      krish|
|     mahesh|
|      krish|
|     mahesh|
|  sudhanshu|
|  sudhanshu|
|  sudhanshu|
|      sunny|
|      sunny|
+-----------+

In [ ]:
df_test = df_pyspark_6.withColumn("New_Column", ascii(col("Name")))

In [ ]:
df_test.show()

+---------+------------+------+----------+
|     Name| Departments|Salary|New_Column|
+---------+------------+------+----------+
|    Krish|Data Science| 10000|        75|
|    Krish|         IOT|  5000|        75|
|   Mahesh|    Big Data|  4000|        77|
|    Krish|    Big Data|  4000|        75|
|   Mahesh|Data Science|  3000|        77|
|Sudhanshu|Data Science| 20000|        83|
|Sudhanshu|         IOT| 10000|        83|
|Sudhanshu|    Big Data|  5000|        83|
|    Sunny|Data Science| 10000|        83|
|    Sunny|    Big Data|  2000|        83|
+---------+------------+------+----------+

In [ ]:
valores = df_pyspark_6.select(mean(col("Salary")))

In [ ]:
type(valores)

pyspark.sql.dataframe.DataFrame

In [ ]:
valores.printSchema()

root
 |-- avg(Salary): double (nullable = true)

In [ ]:
valores.show()

+-----------+
|avg(Salary)|
+-----------+
|     7300.0|
+-----------+

In [ ]:
# Transformar en pandas
df_pyspark_6.toPandas()

        Name   Departments  Salary
0      Krish  Data Science   10000
1      Krish           IOT    5000
2     Mahesh      Big Data    4000
3      Krish      Big Data    4000
4     Mahesh  Data Science    3000
5  Sudhanshu  Data Science   20000
6  Sudhanshu           IOT   10000
7  Sudhanshu      Big Data    5000
8      Sunny  Data Science   10000
9      Sunny      Big Data    2000

In [ ]:
df=df_pyspark_6.toPandas()

In [248]:
df

      Nombre  age  Experience  Salary  new_column
0      Krish   31          10   30000          12
1  Sudhanshu   30           8   25000          10
2      Sunny   29           4   20000           6
3       Paul   24           3   20000           5
4     Harsha   21           1   15000           3
5    Shubham   23           2   18000           4

In [249]:
pyspark_df = spark.createDataFrame(df)

In [250]:
pyspark_df.printSchema()

root
 |-- Nombre: string (nullable = true)
 |-- age: long (nullable = true)
 |-- Experience: long (nullable = true)
 |-- Salary: long (nullable = true)
 |-- new_column: long (nullable = true)

In [251]:
# No tengo claro porque da error
pyspark_df.show()

ERROR:root:KeyboardInterrupt while sending command.
Traceback (most recent call last):
  File "c:\Users\Jonatan\AppData\Local\Programs\Python\Python312\Lib\site-packages\py4j\java_gateway.py", line 1038, in send_command
    response = connection.send_command(command)
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\Jonatan\AppData\Local\Programs\Python\Python312\Lib\site-packages\py4j\clientserver.py", line 511, in send_command
    answer = smart_decode(self.stream.readline()[:-1])
                          ^^^^^^^^^^^^^^^^^^^^^^
  File "c:\Users\Jonatan\AppData\Local\Programs\Python\Python312\Lib\socket.py", line 707, in readinto
    return self._sock.recv_into(b)
           ^^^^^^^^^^^^^^^^^^^^^^^
KeyboardInterrupt

KeyboardInterrupt: